CanUseTemporaryVisibilityModes Method
 Indicates if view can use temporary visibility modes
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool CanUseTemporaryVisibilityModes()
  Visual Basic
Public Function CanUseTemporaryVisibilityModes As Boolean
  Visual C++
public:
bool CanUseTemporaryVisibilityModes()
 Return Value
 True if view can use temporary visibility modes
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →